xdstools2-framework/src/main/webapp/toolkitx/testkit/examples/GazelleSts/samlassertion-validate/body.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</Action><MessageID soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:9901f17a-14c4-4dc0-a639-132b96d5fd0d</MessageID><To soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">https://gazelle.ihe.net/picketlink-sts</To><ReplyTo soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512"><wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Validate</wst:RequestType><wst:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</wst:TokenType><wst:ValidateTarget>$saml-assertion$</wst:ValidateTarget></wst:RequestSecurityToken></soap:Body></soap:Envelope>